export default {
    url: "/api/getRecommendBook",
    method: "get",
    response: (request) => {
        return {
            code: 200,
            data: [{
                title: "三体",
                desc: `“文化大革命”如火如荼进行的同时，军方探寻外星文明的绝秘计划“红岸工程”取得了突破性进展。但无人料到，地球文明向宇宙发出的首声啼呜，彻底改变了人类的命运。\n四光年外，为了生存挣扎的“三体文明”接收到了地球发来的信息。在运用超技术锁死地球人的基础科学之后，三体人庞大的宇宙舰队开始向地球进发……`,
                extra: "给时光以生命，给岁月以文明",
                isbn: "9787536692930",
                cart: [324, true],
                star: [243, false],
                label: "NEW"
            }, {
                title: "三体2·黑暗森林",
                desc: `庞大的三体舰队杀气腾腾直扑太阳系，尖端科技被锁死的地球人面对前所未有的危局，唯一的突破口在于三体人透明的思维。于是，人类制订了神秘莫测的“面壁计划”，秘密展开对三体人的反击。\n“面壁计划”与人类的太空舰队，哪一样才是人类的希望？“黑暗森林”意味着什么？文明在波谲云诡的宇宙中又该如何存续？`,
                extra: "黑暗森林",
                isbn: "9787229100612",
                cart: [617, true],
                star: [611, false],
                label: "HOT"
            }, {
                title: "三体3·死神永生",
                desc: `与三体文明的战争使人类首次看到了宇宙黑暗的真相，地球文明像一个恐惧的孩子，熄灭了巡游的篝火，在暗夜中发抖。\n使两个文明命悬一线的黑暗森林打击，不过是宇宙战场上一个微不足道的插曲。真正的星际战争没人见过，也不可能见到。战争的方式和武器已经远远超出人类的想象，目睹战场之日，即是灭亡之时。\n太阳系中，最后直面宇宙残酷真相的，只有两双眼睛。`,
                extra: "文明涅槃",
                isbn: "9787229100629",
                cart: [524, true],
                star: [235, false],
                label: ""
            }, {
                title: "三体3·死神永生",
                desc: `与三体文明的战争使人类首次看到了宇宙黑暗的真相，地球文明像一个恐惧的孩子，熄灭了巡游的篝火，在暗夜中发抖。\n使两个文明命悬一线的黑暗森林打击，不过是宇宙战场上一个微不足道的插曲。真正的星际战争没人见过，也不可能见到。战争的方式和武器已经远远超出人类的想象，目睹战场之日，即是灭亡之时。\n太阳系中，最后直面宇宙残酷真相的，只有两双眼睛。`,
                extra: "文明涅槃",
                isbn: "9787229100629",
                cart: [524, true],
                star: [235, true],
                label: ""
            }, {
                title: "三体3·死神永生",
                desc: `与三体文明的战争使人类首次看到了宇宙黑暗的真相，地球文明像一个恐惧的孩子，熄灭了巡游的篝火，在暗夜中发抖。\n使两个文明命悬一线的黑暗森林打击，不过是宇宙战场上一个微不足道的插曲。真正的星际战争没人见过，也不可能见到。战争的方式和武器已经远远超出人类的想象，目睹战场之日，即是灭亡之时。\n太阳系中，最后直面宇宙残酷真相的，只有两双眼睛。`,
                extra: "文明涅槃",
                isbn: "9787229100629",
                cart: [524, true],
                star: [235, true],
                label: ""
            }, {
                title: "三体3·死神永生",
                desc: `与三体文明的战争使人类首次看到了宇宙黑暗的真相，地球文明像一个恐惧的孩子，熄灭了巡游的篝火，在暗夜中发抖。\n使两个文明命悬一线的黑暗森林打击，不过是宇宙战场上一个微不足道的插曲。真正的星际战争没人见过，也不可能见到。战争的方式和武器已经远远超出人类的想象，目睹战场之日，即是灭亡之时。\n太阳系中，最后直面宇宙残酷真相的，只有两双眼睛。`,
                extra: "文明涅槃",
                isbn: "9787229100629",
                cart: [524, false],
                star: [235, true],
                label: ""
            }, {
                title: "三体3·死神永生",
                desc: `与三体文明的战争使人类首次看到了宇宙黑暗的真相，地球文明像一个恐惧的孩子，熄灭了巡游的篝火，在暗夜中发抖。\n使两个文明命悬一线的黑暗森林打击，不过是宇宙战场上一个微不足道的插曲。真正的星际战争没人见过，也不可能见到。战争的方式和武器已经远远超出人类的想象，目睹战场之日，即是灭亡之时。\n太阳系中，最后直面宇宙残酷真相的，只有两双眼睛。`,
                extra: "文明涅槃",
                isbn: "9787229100629",
                cart: [524, true],
                star: [235, true],
                label: ""
            }]
        }
    }
}